20221211T125426--kdoc-11-unitcheckerを読む__project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-03T16:37:43Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 11: unitcheckerを読む</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 11: unitcheckerを読む</h1>
<p>
unitcheckerは<a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>の構文解析ライブラリである。
</p>
<div id="outline-container-orgeccc7c2" class="outline-2">
<h2 id="orgeccc7c2"><a href="#orgeccc7c2">memo</a></h2>
<div class="outline-text-2" id="text-orgeccc7c2">
<p>
unitcheckerはgo vetを呼び出すのに使われるパッケージである。
</p>

<div class="org-src-container">
<pre class="src src-go">unitchecker.Main(
        asmdecl.Analyzer,
        assign.Analyzer,
</pre>
</div>

<p>
というように、独立して存在する各Analyzerを呼び出す形式になっている。
</p>
</div>
<div id="outline-container-orgfdc7b10" class="outline-3">
<h3 id="orgfdc7b10"><a href="#orgfdc7b10">Main()</a></h3>
<div class="outline-text-3" id="text-orgfdc7b10">
<p>
一般的なコマンドラインツールという感じ。引数・オプションチェックやヘルプの表示をしている。
</p>

<p>
引数をパースして、最終的にRunを呼び出す。おかしかったときはos.Exitで終了する。
</p>
</div>
</div>
<div id="outline-container-orgcc07cb5" class="outline-3">
<h3 id="orgcc07cb5"><a href="#orgcc07cb5">Run()</a></h3>
<div class="outline-text-3" id="text-orgcc07cb5">
<p>
configファイルを読み取ってanalysisを実行する。
</p>

<ul class="org-ul">
<li>NewFileSetを実行するのはなぜだろう</li>
<li>書き換えもやる</li>
<li>アウトプット設定による分岐
<ul class="org-ul">
<li>runした結果をイテレートしてツリーを作る
<ul class="org-ul">
<li>ツリーを表示する</li>
</ul></li>
<li>結果をイテレートしてプレーンテキストで表示する</li>
</ul></li>
<li>本処理はrun()
<ul class="org-ul">
<li>load, parse, typecheck</li>
<li>渡されたファイル(.go)をパースする。これはparseパッケージのもの
<ul class="org-ul">
<li>ASTにしてまずいところを検証するんだな、という感じはわかる</li>
</ul></li>
<li>importerForCompiler()ってなんだ。なんでコンパイラが出てくる</li>
<li>importerFunc()</li>
<li>Configのフィールドたくさんあるな。どこで初期化してるんだっけ</li>
<li>typesは、TypeOf()とか定義してるパッケージ。Info構造体に色々入っている</li>
<li>types.Infoを初期化して、チェックして値を入れてるのか</li>
<li>200行ある関数</li>
</ul></li>
<li><a href="https://engineering.mercari.com/blog/entry/2018-12-16-150000/">Goにおける静的解析のモジュール化について | メルカリエンジニアリング</a>
<ul class="org-ul">
<li>参考になる</li>
<li>Analyzerの出力結果は3つある
<ul class="org-ul">
<li>factは、静的解析する中で見つけられた事実を示す</li>
<li>Diagnosticsはソースコードの任意の位置に紐付いた情報</li>
<li>resultはそのままユーザに返されるわけではなく、ほかのanalyzerに渡される情報</li>
</ul></li>
<li>analyzerの例
<ul class="org-ul">
<li><a href="https://github.com/kd-collective/tools/blob/3da7f1e4c2483c10122fab460ebf8d9e04095385/go/analysis/passes/findcall/findcall.go#L40">https://github.com/kd-collective/tools/blob/3da7f1e4c2483c10122fab460ebf8d9e04095385/go/analysis/passes/findcall/findcall.go#L40</a></li>
</ul></li>
</ul></li>
<li>driver(vet) -&gt; unitchecker -&gt; analyzer</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
